app/Models/ModelJenisBuah.php

SELECT *
FROM `tb_jenis_buah`
---
    public function semua_jenis_buah()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->get()->getResultArray();